In [10]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [11]:
friendsdata={"names":names, "woman":woman, "ages":ages, "country":country, "education":education }

In [12]:
import pandas

In [13]:
friends=pandas.DataFrame.from_dict(friendsdata)

In [14]:
# where is the youngest male in the group from?

In [15]:
# Find the answer using sort_values()
tosort=["ages"]
order=[True]
friends.sort_values(by=tosort,ascending=order)

     names  woman  ages  country education
5    Juana   True    27     Peru    Master
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
0    Tomás  False    32    Chile      Bach
4     Alan  False    32     Peru      Bach
1  Pauline   True    33  Senegal      Bach

In [26]:
#  Do some research and find the answer using where() and min()
filter1=friends.ages<30
friends.where(filter1)

   names  woman  ages country education
0    NaN    NaN   NaN     NaN       NaN
1    NaN    NaN   NaN     NaN       NaN
2  Pablo    0.0  28.0   Spain    Master
3    NaN    NaN   NaN     NaN       NaN
4    NaN    NaN   NaN     NaN       NaN
5  Juana    0.0  27.0    Peru    Master

In [27]:
# Do some research and find the answer using query() and min()
filter2='ages<30'
friends.query(filter2)

   names  woman  ages country education
2  Pablo  False    28   Spain    Master
5  Juana  False    27    Peru    Master